---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsError
source: html/0d64e116-5fb4-ce3d-a30b-1ab6258aeea3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsError Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinElementsError { get; }
```